# manage services via `brew services`
tap "homebrew/services"

brew "macvim", args: ['with-override-system-vim']
brew "z"
brew "the_silver_searcher"
brew "tmux"

brew "postgresql"
brew "redis"
# phantomjs via homebrew is broken until
# https://github.com/Homebrew/homebrew/issues/42249 gets resolved
# brew "phantomjs"
brew "watchman"

brew "elixir"

# manage node versions
brew 'nodenv'

# manage ruby versions
brew "rbenv"
brew "ruby-build"
brew "rbenv-gem-rehash"

# casks
brew "caskroom/cask/brew-cask"

cask "seil"
cask "spark"
cask "istat-menus"
cask "slack"
cask "papers"
cask "launchbar"
cask "flux"
