# manage services via `brew services`
tap "homebrew/services"

# get cask
tap "caskroom/cask"

#########
# Fonts #
#########

# install fonts via homebrew
tap "caskroom/fonts"

# http://adobe-fonts.github.io/source-code-pro/
cask "font-source-code-pro"
# http://font.ubuntu.com/#charset-mono-regular
cask "font-ubuntu-mono-powerline"

#########
# Tools #
#########

tap "neovim/neovim"
brew "neovim", args: ['HEAD']
brew "tmux", args: ['HEAD']
brew "z"
brew "the_silver_searcher"
brew "watchman"

brew "postgresql"
brew "redis"
brew "phantomjs"

brew "elixir"

# manage node versions
brew 'nodenv'

# manage ruby versions
brew "rbenv"
brew "ruby-build"
brew "rbenv-gem-rehash"

#########
# Casks #
#########

cask "seil"
cask "spark"
cask "istat-menus"
cask "slack"
cask "papers"
cask "launchbar"
cask "flux"
